export const locations = [
  ["айтишник", 56.011673, 92.875694, "⌨️"],
  ["инспектор", 56.020616, 92.8704, "🚦"],
  ["педагог", 56.017512, 92.887712, "🎓"],
  ["поварёнок", 56.009242, 92.867627, "🍲"],
  ["медик", 56.018777, 92.885608, "🩺"],
  ["молодожены", 56.013317, 92.893992, "💛"],
  ["горняк Гоша", 56.001932, 92.934922, "⛏️"],
  ["покоритель Енисея", 56.006234, 92.870033, "🏔️"],
  ["художник", 56.012981, 92.852185, "🎨"],
  ["чтец", 56.017291, 92.851191, "📖"],
  ["футболист", 56.006772, 92.876019, "⚽"],
  ["вовчик", 56.045692, 92.879043, "🌻"],
  ["борец", 55.989701, 92.878984, "🏅"],
  ["строитель", 56.00593, 92.838026, "🧱"],
  ["хранитель монет", 56.020294, 92.796281, "🪙"],
  ["грек и суслик", 56.043463, 92.896123, "🤝"],
  ["страж", 56.023553, 92.859546, "🛡️"],
  ["космонавт", 56.055449, 92.967947, "🚀"],
  ["разметчик", 55.965446, 92.729002, "🛣️"],
  ["обрада", 56.021704, 92.980038, "🌷"],
  ["клим", 56.005456, 92.849158, "🌲"],
  ["походник", 55.953603, 92.841689, "🎒"],
  ["банщик", 56.063069, 92.984607, "🧖"],
  ["с зонтиком", 56.116907, 92.919179, "☂️"],
].map(([name, lat, lon, icon], id) => ({ id, name, lat, lon, icon }));
export function navigationUrl(point) {
  return `https://yandex.ru/maps/?pt=${point.lon},${point.lat}&z=17&l=map`;
}
export function progress(count, total) {
  return Math.round((count / total) * 100);
}
